{
  "Dapatkan MBA! 100% online, 100% di tangan anda!": "Get your MBA! 100% online, 100% on your terms!",
  "Ketahui lebih lanjut": "Call for details",
  "Fakta Utama": "Key Facts",
  "Mod": "Delivery",
  "Online": "Online",
  "Tahap": "Study Level",
  "Postgraduate": "Postgraduate",
  "Jenis Program": "Programme Type",
  "Master’s": "Master’s",
  "Fakta Utama Program": "Programme Key Facts",
  "Lihat semua": "View all",
  "Tempoh": "Duration",
  "12 bulan": "12 months",
  "Jumlah Modul": "Modules",
  "Yuran Per Modul": "Price Per Module",
  "Intake": "Intake",
  "Sabtu pertama setiap bulan": "1st saturday every month",
  "Muat Turun": "Download a",
  "Panduan Program": "Programme Guide",
  "Dapatkan maklumat lanjut program, termasuk:": "Dapatkan maklumat lanjut program, termasuk:",
  "Hasil Pembelajaran": "Learning Outcomes",
  "Yuran": "Fees",
  "Ringkasan Program": "Course Overview",
  "Kejayaan di tangan anda, dengan program MBA dalam talian yang fleksibel sepenuhnya. Direka untuk profesional yang bekerja, kursus ini membolehkan anda mengimbangi pengajian anda dengan kerjaya dan kehidupan peribadi anda dengan mudah.": "Take control of your education with our flexible, fully online MBA program. Designed for working professionals, this course allows you to balance your studies with your career and personal life effortlessly.",
  "1 Bulan, 1 Modul: Fokus secara intensif pada satu modul setiap bulan, memudahkan pengurusan masa anda dan penyerapan bahan secara menyeluruh.": "One Month, One Module: Focus intensively on one module each month, making it easier to manage your time and absorb the material thoroughly.",
  "Intake Setiap Bulan: Mulakan perjalanan MBA anda bila-bila masa": "Monthly Intake: Start your MBA journey whenever you're ready with our convenient monthly enrollment options.",
  "Bayaran Per Modul: Nikmati fleksibiliti membayar satu modul pada satu masa dengan harga yang kompetitif.": "Pay Per Module: Enjoy the flexibility of paying for one module at a time with our competitive pricing.",
  "Syarat kemasukan": "Entry Requirements",
  "Kemasukan Terus: Terbuka untuk graduan Degree/ Ijazah Sarjana Muda": "Direct Entry: Open to anyone with a degree, regardless of field of study.",
  "Kemasukan APEL: Terbuka untuk graduan STPM atau Diploma, berumur 30 tahun ke atas, dengan 5 tahun pengalaman kerja": "APEL entry: Designed for individuals aged 30 and above, posses STPM or Diploma, with 5 years of work experience.",
  "Kemasukan Micro Credentials: Tiada syarat kelayakan masuk. Terbuka untuk semua.": "Micro Credentials entry: No entry requirements, open to all.",
  "Pensyarah": "Lecturer",
  "Pengalaman 28 tahun dalam kepimpinan pendidikan": "Bringing 28 years of expertise in education leadership",
  "Dari pensyarah hingga Naib Canselor": "From lecturer to Vice Chancellor",
  "Pakar dalam pengambilan pelajar, kecemerlangan akademik, dan pembangunan institusi": "Expert in recruitment, academic excellence, and institutional branding",
  "Ahli Lembaga Penasihat untuk Education Malaysia Global Service (EMGS)": "Advisory board member for Education Malaysia Global Service (EMGS)",
  "Bersemangat dalam pendidikan berkualiti dan pertumbuhan mampan": "Passionate about quality education and sustainable growth",
  "Soalan Lazim": "Frequently asked questions",
  "Adakah program MBA sepenuhnya dalam talian (online)?": "Is the MBA program fully online?",
  "Ya, program MBA kami adalah sepenuhnya dalam talian, membolehkan anda belajar dari mana-mana di dunia pada masa yang sesuai untuk anda.": "Yes, our MBA program is 100% online, allowing you to study from anywhere in the world at your convenience.",
  "Berapa tempoh program MBA?": "What is the duration of the MBA program?",
  "Biasanya, program MBA kami boleh diselesaikan dalam tempoh satu tahun dengan pengajian fleksibel, direka khas untuk profesional yang bekerja.": "Typically, our MBA program can be completed in one year of flexible study, tailored for working professionals.",
  "Apakah syarat kemasukan yang diperlukan?": "Are there any specific admission requirements?",
  "Untuk memohon, anda perlu memiliki ijazah sarjana atau yang setara (Direct Entry), atau individu berumur 30 tahun ke atas, memiliki STPM atau Diploma, dan pengalaman kerja selama 5 tahun (APEL Entry). Tiada syarat kemasukan untuk (Micro Credentials Entry), terbuka kepada semua! Butir-butir spesifik boleh didapati dalam panduan Program kami.": "To apply, you'll need a bachelor's degree or equivalent (Direct Entry), or individuals aged 30 and above, possess STPM or Diploma, and a 5 years of work experience (APEL Entry). No entry requirements for (Micro Credentials Entry), open to everyone! Specific details can be found on our Programme guide. Download it",
  "Muat turun di sini": "here",
  "Bolehkah saya bekerja sambil belajar MBA?": "Can I work while pursuing the MBA?",
  "Tentu saja! Jadual yang fleksibel kami direka untuk profesional yang sibuk. Ramai pelajar kami terus bekerja sepenuh masa semasa menyelesaikan pengajian MBA mereka.": "Absolutely! Our flexible schedule is designed for busy professionals. Many of our students continue to work full-time while completing their MBA studies.",
  "Berapakah yuran pengajian dan pilihan pembayaran yang tersedia?": "What are the tuition fees and payment options?",
  "Yuran pengajian kami kompetitif dan direka untuk memenuhi bajet anda. (Bayar per modul). Kami menawarkan pelan pembayaran yang fleksibel untuk memudahkan pembiayaan pendidikan anda. Pengeluaran EPF/KWSP juga tersedia.": "Our tuition fees are competitive and designed to fit within your budget. (Pay per module).  We offer flexible payment plans to make financing your education easier. EPF/ KWSP withdrawal available.",
  "Kembali ke atas": "Back to top",
  "Dapatkan info": "Call for information"
}